Revit 2027 API
DividedPath.SeparateReferencesIntoConnectedReferences Method
 This function separates the input curve references into groups of connected curve references. Each group of connected curve references can be used to create a divided path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<IList<Reference>> SeparateReferencesIntoConnectedReferences(
	Document document,
	IList<Reference> curveReferences
)
Public Shared Function SeparateReferencesIntoConnectedReferences (
	document As Document,
	curveReferences As IList(Of Reference)
) As IList(Of IList(Of Reference))
public:
static IList<IList<Reference^>^>^ SeparateReferencesIntoConnectedReferences(
	Document^ document,
	IList<Reference^>^ curveReferences
)
static member SeparateReferencesIntoConnectedReferences :
        document : Document *
        curveReferences : IList<Reference> -> IList<IList<Reference>>
Parameters
document Document
 The document.
curveReferences IList<Reference>
 The references.
Return Value
IList<IList<Reference>>
 The grouped references
Exceptions
Exception | Condition
ArgumentException |  Not all curve references in curveReferences represent a curve or an edge
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  this operation failed.
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace